/*
final List<String> elementsOfDoaaAboutLivelihoodList = [
  'رَبِّ إِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ',
  'وَقُل رَّبِّ زِدْنِي عِلْمًا',
  'رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ',
  'اللَّهُمَّ اكْفِنِي بحلالِكَ عن حرامِكَ، وأَغنِنِي بفضلِكَ عَمَّن سواكَ',
  'اللَّهُمَّ ارزقني رزقًا واسعًا حلالًا طيبًا من غير كدٍّ، واستجب دعائي من غير ردٍّ',
  'اللَّهُمَّ بارِكْ لنا في رِزقِنا، وزِدْنا من فضلك',
  'اللَّهُمَّ اجعل رزقي في قلبي يقينًا، وفي نفسي قناعةً، وفي بدني عافيةً، وبارك لي فيما رزقتني',
  'اللَّهُمَّ إن كان رزقي في السماء فأنزله، وإن كان في الأرض فأخرجه، وإن كان بعيدًا فقرِّبه، وإن كان قريبًا فيسِّره، وإن كان قليلًا فبارك لي فيه، وإن كان كثيرًا فبارك لي فيه واجعلني شاكرًا له',
  'اللَّهُمَّ ارزقني رزقًا طيبًا واسعًا، وعلِّمني شكرَه، ووفِّقني لحُسن إنفاقه',
  'اللَّهُمَّ افتح عليَّ أبواب رحمتك، وأبواب رزقك، وأبواب توفيقك، وأغنني بفضلك عمن سواك',
];
*/
