/*
final List<Map<String, dynamic>> elementsOfHadithAboutMoralsList = [
  {
    'hadith': 'قال رسول الله ﷺ: «إنما بُعِثتُ لأُتَمِّمَ صالحَ الأخلاق».',
    'narrator': 'الراوي: أبو هريرة رضي الله عنه.',
    'attribution': 'الإسناد: عن أبي هريرة عن النبي ﷺ.',
    'source': 'المصدر: رواه أحمد (8952)، وصححه الألباني.',
  },
  {
    'hadith': 'قال رسول الله ﷺ: «أكملُ المؤمنين إيمانًا أحسنُهم خُلقًا».',
    'narrator': 'الراوي: أبو هريرة رضي الله عنه.',
    'attribution': 'الإسناد: عن أبي هريرة عن النبي ﷺ.',
    'source': 'المصدر: سنن أبي داود (4682)، وصححه الألباني.',
  },
  {
    'hadith':
        'قال رسول الله ﷺ: «ما من شيءٍ أثقلَ في ميزانِ المؤمنِ يومَ القيامةِ من حسنِ الخُلقِ».',
    'narrator': 'الراوي: أبو الدرداء رضي الله عنه.',
    'attribution': 'الإسناد: عن أبي الدرداء عن النبي ﷺ.',
    'source': 'المصدر: سنن الترمذي (2002)، وصححه الألباني.',
  },
  {
    'hadith':
        'قال رسول الله ﷺ: «إنَّ المؤمنَ لَيُدرِكُ بحُسنِ خُلُقِه درجةَ الصائمِ القائم».',
    'narrator': 'الراوي: عائشة رضي الله عنها.',
    'attribution': 'الإسناد: عن عائشة عن النبي ﷺ.',
    'source': 'المصدر: سنن أبي داود (4798)، وصححه الألباني.',
  },
  {
    'hadith':
        'قال رسول الله ﷺ: «إنَّ من أحبِّكم إليَّ وأقربِكم مني مجلسًا يومَ القيامةِ أحاسنَكم أخلاقًا».',
    'narrator': 'الراوي: عبد الله بن عمرو رضي الله عنهما.',
    'attribution': 'الإسناد: عن عبد الله بن عمرو عن النبي ﷺ.',
    'source': 'المصدر: سنن الترمذي (2018)، وصححه الألباني.',
  },
  {
    'hadith': 'قال رسول الله ﷺ: «إنَّ خيارَكم أحاسنُكم أخلاقًا».',
    'narrator': 'الراوي: عبد الله بن عمرو رضي الله عنهما.',
    'attribution': 'الإسناد: عن عبد الله بن عمرو عن النبي ﷺ.',
    'source': 'المصدر: صحيح البخاري (3559)، وصحيح مسلم (2321).',
  },
  {
    'hadith':
        'قال رسول الله ﷺ: «أحَبُّ عبادِ اللهِ إلى اللهِ أحسَنُهم خُلُقًا».',
    'narrator': 'الراوي: عبد الله بن عمرو رضي الله عنهما.',
    'attribution': 'الإسناد: عن عبد الله بن عمرو عن النبي ﷺ.',
    'source': 'المصدر: مسند أحمد (6708)، وصححه الألباني.',
  },
  {
    'hadith':
        'قال رسول الله ﷺ: «إنَّ المؤمنَ لَيُدرِكُ بحُسنِ خُلُقِه درجةَ الصائمِ القائم».',
    'narrator': 'الراوي: أبو أمامة الباهلي رضي الله عنه.',
    'attribution': 'الإسناد: عن أبي أمامة عن النبي ﷺ.',
    'source': 'المصدر: مسند أحمد (22215)، وصححه الألباني.',
  },
  {
    'hadith':
        'قال رسول الله ﷺ: «ليس المؤمنُ بالطَّعَّانِ، ولا اللَّعَّانِ، ولا الفاحشِ، ولا البَذِيءِ».',
    'narrator': 'الراوي: عبد الله بن مسعود رضي الله عنه.',
    'attribution': 'الإسناد: عن ابن مسعود عن النبي ﷺ.',
    'source': 'المصدر: سنن الترمذي (1977)، وصححه الألباني.',
  },
  {
    'hadith':
        'قال رسول الله ﷺ: «إنَّ الرِّفقَ لا يكونُ في شيءٍ إلا زانَه، ولا يُنزَعُ من شيءٍ إلا شانه».',
    'narrator': 'الراوي: عائشة رضي الله عنها.',
    'attribution': 'الإسناد: عن عائشة عن النبي ﷺ.',
    'source': 'المصدر: صحيح مسلم (2594).',
  },
];
*/
