/*
final List<String> elementsOfRemembrancesAboutMosQueRemembrancesList = [
  'اللّهُمَّ اجعل صلاتي خالصة لوجهك الكريم.',
  'اللّهُمَّ اجعلني من الذين يستمعون القول فيتبعون أحسنه.',
  'اللّهُمَّ اجعلني من المقبولين في صلاتي، واغفر لي ذنوبي.',
  'اللّهُمَّ اجعل صلاتي نورًا لي في الدنيا والآخرة.',
  'اللّهُ أكْبَر، اللّهُ أكْبَر، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير. (دعاء عند دخول المسجد)',
  'اللّهُمَّ اجعلني من الذين يكثرون من ذكر الله ويثبتون على طاعته.',
  'اللّهُمَّ اجعل قلبي حاضرًا وخاشعًا في صلاتي.',
  'اللّهُمَّ اجعل المسجد مكان راحة وسكينة لي، ووفقني للقيام بحقوقه.',
  'اللّهُمَّ اجعلني من الذين يخرجون من المسجد وهم أفضل حالًا مما دخلوا.',
  'اللّهُمَّ اجعل صلاتي وسعيي في المسجد مقبولًا عندك، واغفر لي ما قدمت وما أخرت.',
];
*/
