final List<String> elementsOfRemembrancesAboutMorningRemembrancesList = [
  'أصبحنا وأصبح الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير.',
  'اللّهُمَّ إني أسألك خير هذا اليوم فتحه ونصره ونوره وبركته وهداه، وأعوذ بك من شر ما فيه وشر ما بعده.',
  'رضيت بالله ربًا، وبالإسلام دينًا، وبمحمد ﷺ نبيًا.',
  'اللّهُمَّ بك أصبحنا وبك أمسينا، وبك نحيا وبك نموت وإليك النشور.',
  'اللّهُمَّ اجعلني من الذين يذكرونك كثيرًا في صباحهم ومساءهم.',
  'أعوذ بكلمات الله التامات من شر ما خلق.',
  'سبحان الله وبحمده، سبحان الله العظيم.',
  'اللّهُمَّ إني أعوذ بك من الكسل والهم والحزن، وأعوذ بك من العجز والجبن والبخل.',
  'اللّهُمَّ اجعل هذا اليوم يوم خير وبركة لي ولعائلتي وأحبتي.',
  'اللّهُمَّ اجعلنا من أهل التوفيق والسداد في القول والعمل، واغفر لنا ما تقدم من ذنبنا وما تأخر.',
];
