final List<String> elementsOfDoaaAboutNotForgettingList = [
  'اللّهُمَّ لا تَنسَني ما علمتني، وذكّرني ما نسيت، واجعل قلبي حافِظًا لعلومك.',
  'اللّهُمَّ ارزقني حفظًا وسدادًا، وذكّرني ما أحتاجه في ديني ودنياي.',
  'اللّهُمَّ اجعل قلبي حافِظًا ولساني ذاكراً وعقلي متفكّرًا في طاعتك.',
  'اللّهُمَّ قوِّ ذاكرتي وفكري، واجعلني أستفيد من علمي بدون نسيان.',
  'اللّهُمَّ اجعل القرآن ربيع قلبي ونور صدري وجلاء حزني وذهاب همي، وذكّرني بتلاوته دائمًا.',
  'اللّهُمَّ اجعلني من الذين يذكرونك كثيرًا فلا ينسون أمرك أبدًا.',
  'اللّهُمَّ علّمني ما ينفعني وانفعني بما علمتني، وارزقني حفظه دون نسيان.',
  'اللّهُمَّ اجعل تذكري للخير دائمًا، وذكّرني بواجباتي تجاهك وتجاه الناس.',
  'اللّهُمَّ اجعلني ممن يسلكون الطريق الصحيح دائمًا بلا تردد، وذكّرني بحكمتك وقت الشدة.',
  'اللّهُمَّ ثبت قلبي على طاعتك وذكّرني بكل ما يغنيني عن الضلال والنسيان.',
];
