final List<String> elementsOfDoaaAboutVeilList = [
  'اللّهُمَّ اكفني ما أهمّني، واغنني بما رزقتني، وستّرني عن أعين الخلق كما سترت عبدك المحمود.',
  'اللّهُمَّ اجعل لي من أمري فرجًا ومخرجًا، وستّرني فوق الأرض وتحت الأرض ويوم العرض عليك.',
  'اللّهُمَّ استر عورتي وآمن روعتي، واحفظني من فضح نفسي.',
  'اللّهُمَّ سترني على الدّين والدنيا والآخرة، واجعل عيوني مطمئنة، وقلبي مطمئنًا.',
  'اللّهُمَّ اجعل لي من كل همٍّ فرجًا، ومن كل ضيقٍ مخرجًا، وستّرني برحمتك.',
  'اللّهُمَّ احفظني من عيون الناس، وستّرني عن أعينهم، كما سترت عبادك الصالحين.',
  'اللّهُمَّ احفظني من الفضيحة، وارزقني سترًا دائمًا، وراحةً في نفسي.',
  'اللّهُمَّ احفظ لي عورتي، واستر عليّ في حياتي وبعد موتي.',
  'اللّهُمَّ اجعلني في الدنيا والآخرة من المستورين، ولا تجعلني من المكشوفين أمام الناس.',
  'اللّهُمَّ استرني في السرّاء والضرّاء، وأدم عليّ نعمة الستر والرحمة.',
];
