/*
final List<String> elementsOfRemembrancesAboutSleepingRemembrancesList = [
  'باسمك ربي وضعتُ جنبي، وبك أرفعه، فإن أمسكت نفسي فارحمها، وإن أرسلتها فاحفظها بما تحفظ عبادك الصالحين.',
  'اللّهُمَّ باسمك أحيا وأموت.',
  'أمسكت نفسي يومي هذا، فارحمها، واغفر لي ما قدمت وما أخرت، وأنت خير الحافظين.',
  'اللّهُمَّ قني عذابك يوم تبعث عبادك.',
  'اللّهُمَّ اجعلني من أهل الجنة برحمتك، ونجني من النار بعفوك.',
  'اللّهُمَّ اكتب لي الراحة والسكينة في نومي، وأدم عليّ نعمة الطمأنينة.',
  'أعوذ بكلمات الله التامات من شر ما خلق، وشر نفسي، وشر كل دابة أنت آخذ بناصيتها.',
  'سبحان الله وبحمده، سبحان الله العظيم.',
  'اللّهُمَّ اجعل نومي طاعة لي، واستيقاظي لعبادتك وذكرك.',
  'اللّهُمَّ اجعل نومي مريحًا، وارزقني خير ما بعده عند الاستيقاظ، ووفقني لكل خير.',
];
*/
