/*
final List<String> elementsOfRemembrancesAboutPrayerRemembrancesList = [
  'عند التوجه للصلاة: اللّهُمَّ اجعلني من المقيمين الصلاة، ومن ذريتي، ربنا وتقبّل دعاء.',
  'عند دخول المسجد: اللّهُمَّ افتح لي أبواب رحمتك.',
  'عند الخروج من المسجد: اللّهُمَّ إني أسألك من فضلك.',
  'بين الأذان والإقامة (دعاء مستجاب): اللّهُمَّ رب هذه الدعوة التامة، والصلاة القائمة، آت محمدًا الوسيلة والفضيلة، وابعثه مقامًا محمودًا الذي وعدته.',
  'عند تكبيرة الإحرام: سبحانك اللّهُمَّ وبحمدك، وتبارك اسمك، وتعالى جدّك، ولا إله غيرك.',
  'في الركوع: سبحان ربي العظيم.',
  'في السجود: سبحان ربي الأعلى.',
  'بين السجدتين: رب اغفر لي، رب اغفر لي.',
  'بعد التشهد الأخير: اللّهُمَّ إني أعوذ بك من عذاب جهنم، ومن عذاب القبر، ومن فتنة المحيا والممات، ومن فتنة المسيح الدجال.',
  'بعد التسليم والانتهاء من الصلاة: أستغفر الله (ثلاثًا), ثم تقول اللّهُمَّ أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام.',
];
*/
